In [2]:
import pandas as pd
import matplotlib.pyplot as plt

rf = pd.read_csv("/Users/arsenpankiv/Desktop/Python_practice/small_dataset.csv")
rf["date"] = pd.to_datetime(rf["date"])

rj = rf.copy()

In [3]:
rf["median_salary"]

0     33020.0
1     21480.0
2         NaN
3     18621.0
4     18532.0
5         NaN
6     23677.0
7     19563.0
8     20580.0
9     18737.0
10    16727.0
11        NaN
12        NaN
13    17939.0
14    17803.0
15    17866.0
16    17974.0
17    15798.0
18    16914.0
19    16457.0
20    33020.0
21    18621.0
22    17866.0
23        NaN
24    17803.0
25    18532.0
Name: median_salary, dtype: float64

In [4]:

"""let's use apply method but frist let's delete nan values """
cleaned = rf[pd.notna(rf["median_salary"])].copy()
cleaned

def projected_salary(median_salary):
    return median_salary * 1.03

# cleaned["median_salary"].apply(projected_salary)
"""let's create a new column"""

cleaned["median_salr_inflated"] = cleaned["median_salary"].apply(projected_salary)

"""let's now capre these two columns """

cleaned[["median_salary","median_salr_inflated"]]

"""let's now use lambda function and create another column"""

cleaned["lambda_applied"] = cleaned["median_salary"].apply(lambda salary: salary * 1.03)

cleaned[["median_salary","median_salr_inflated", "lambda_applied"]]

    median_salary  median_salr_inflated  lambda_applied
0         33020.0              34010.60        34010.60
1         21480.0              22124.40        22124.40
3         18621.0              19179.63        19179.63
4         18532.0              19087.96        19087.96
6         23677.0              24387.31        24387.31
7         19563.0              20149.89        20149.89
8         20580.0              21197.40        21197.40
9         18737.0              19299.11        19299.11
10        16727.0              17228.81        17228.81
13        17939.0              18477.17        18477.17
14        17803.0              18337.09        18337.09
15        17866.0              18401.98        18401.98
16        17974.0              18513.22        18513.22
17        15798.0              16271.94        16271.94
18        16914.0              17421.42        17421.42
19        16457.0              16950.71        16950.71
20        33020.0              34010.60        34010.60
21        18621.0              19179.63        19179.63
22        17866.0              18401.98        18401.98
24        17803.0              18337.09        18337.09
25        18532.0              19087.96        19087.96

In [5]:
"""let's now convert our last column skills which is a string into a list """

"""first item of the column"""

rf["skills_list"][0]

list(rf["skills"][0])

"""it's now appripriate way we get a total mess """
print(rf["skills_list"][0])
print(type(rf["skills_list"][0]))

KeyError: 'skills'

In [6]:
import ast 

"""let's use function of liveteral_eval"""

x = ast.literal_eval(rf["skills_list"][0])
print(x)
print(type(x))

['SQL', 'Business Intelligence', 'Dashboarding']
<class 'list'>

In [7]:
"""but we can't run this method on the whole column; instead we need to use apply method for it """
import ast 
def clean_list(skills):
    if pd.notna(skills):
        return ast.literal_eval(skills)

rf["skills_list"] = rf["skills_list"].apply(clean_list)

"""it not good way ; it's not working properly after the 1st run it crashes"""

"it not good way ; it's not working properly after the 1st run it crashes"

In [8]:
"""ValueError: malformed node or string"""

rf[pd.isna(rf["skills_list"])]

,code,area,date,median_salary,life_satisfaction,mean_salary,recycling_pct,population_size,num_of_jobs,job_title,skills_list,job__health_insurance,work_from_home
6,E09000007,camden,1999-11-03,23677.0,NaN,30249.0,13.0,NaN,84000.0,Statistician,None,True,False
18,S92000003,scotland,1999-06-09,16914.0,NaN,19667.0,NaN,5071950.0,76000.0,Database Administrator,None,False,False
22,K03000001,great britain,1999-11-01,17866.0,NaN,21379.0,NaN,57005421.0,NaN,Operations Analyst,None,True,True

In [9]:
"""let's fix this problem and use instead labmba funuction"""
import ast 

# rf["skills_list"] = rf["skills_list"].apply(lambda skills: ast.literal_eval(skills) if pd.notna(skills) else skills )

"""fixed AI version"""

import ast

rf["skills_list"] = rf["skills_list"].apply(
    lambda skills: ast.literal_eval(skills) if isinstance(skills, str) else skills
)


rf["skills_list"][3]
type(rf["skills_list"][3]
)

list

You're running into this error because some entries in the "skills_list" column are already actual Python lists (not strings). When you try to apply ast.literal_eval() to them, it fails — especially because pd.notna() isn't reliable for checking if something is a string (it works on scalars, but can return arrays for lists, causing this ambiguity).

   Why this works:
ast.literal_eval() should only run on strings like "['Python', 'SQL']".

If the value is already a list, we leave it untouched.

isinstance(..., str) avoids the ambiguous .any() / .all() issue.

In [10]:
"""so far we have applied this function on the column; let's now instead apply it on a row ; default is 0 which is a column 1 == row"""
"""we will create a new column row_lambda* and using and rj dataframe"""
rj

def selection21(row):
    """let's create our own if statement"""
    if row["num_of_jobs"] > 120000:
        return row["mean_salary"] * 1.03
    else:
        return 1

    
rj["row_lambda*"] = rj.apply(selection21,axis =1)

rj["row_lambda*"] 

rj

,code,area,date,median_salary,life_satisfaction,mean_salary,recycling_pct,population_size,num_of_jobs,job_title,skills_list,job__health_insurance,work_from_home,row_lambda*
0,E09000001,city of london,1999-12-12,33020.0,NaN,48922.0,0.0,6581.0,122000.0,Operations Analyst,"['SQL', 'Business Intelligence', 'Dashboarding']",True,False,50389.66
1,E09000002,barking and dagenham,1999-01-11,21480.0,NaN,23620.0,3.0,162444.0,115000.0,Database Administrator,"['Data Recovery', 'Security', 'NoSQL']",False,True,1.00
2,E09000003,brent,1999-03-03,NaN,NaN,23128.0,8.0,313469.0,291000.0,Database Administrator,"['PostgreSQL', 'Data Integrity', 'Automation']",True,True,23821.84
3,E09000004,bexley,1999-07-05,18621.0,NaN,21386.0,18.0,217458.0,160000.0,Statistician,"['Probability', 'SAS', 'Regression']",False,False,22027.58
4,E09000005,brent,1999-12-12,18532.0,NaN,20911.0,6.0,260317.0,134000.0,Statistician,"['Statistics', 'Data Cleaning', 'Machine Learn...",True,True,21538.33
5,E09000006,bromley,1999-09-08,NaN,NaN,21293.0,13.0,NaN,113000.0,Statistician,"['R', 'Python', 'Data Analysis']",False,False,1.00
6,E09000007,camden,1999-11-03,23677.0,NaN,30249.0,13.0,NaN,84000.0,Statistician,NaN,True,False,1.00
7,E09000008,croydon,1999-03-02,19563.0,NaN,22205.0,13.0,NaN,102000.0,Statistician,"['R', 'Python', 'Data Analysis']",True,True,1.00
8,E09000009,ealing,1999-01-11,20580.0,NaN,25046.0,12.0,302252.0,120000.0,Statistician,"['Probability', 'SAS', 'Regression']",False,True,1.00
9,E12000008,south east,1999-10-12,18737.0,NaN,22361.0,15.0,7955124.0,74000.0,Operations Analyst,"['Excel', 'Reporting', 'Problem Solving']",True,False,1.00
10,E12000009,south west,1999-11-04,16727.0,NaN,19203.0,14.0,4880958.0,81000.0,Operations Analyst,"['Operations Research', 'KPIs', 'Communication']",False,False,1.00
11,E13000001,inner london,1999-07-07,NaN,NaN,NaN,NaN,2750716.0,89000.0,Statistician,"['Probability', 'SAS', 'Regression']",True,True,1.00
12,E13000002,outer london,1999-02-03,NaN,NaN,NaN,NaN,4403196.0,177000.0,Database Administrator,"['Data Recovery', 'Security', 'NoSQL']",False,True,NaN
13,E92000001,england,1999-02-11,17939.0,NaN,21561.0,10.0,49032872.0,146000.0,Database Administrator,"['MySQL', 'Oracle', 'Performance Monitoring']",True,False,22207.83
14,K02000001,united kingdom,1999-11-12,17803.0,NaN,21314.0,NaN,58684427.0,NaN,Statistician,"['R', 'Python', 'Data Analysis']",False,True,1.00
15,K03000001,great britain,1999-08-01,17866.0,NaN,21379.0,NaN,57005421.0,NaN,Operations Analyst,"['Python', 'Optimization', 'Process Improvement']",True,False,1.00
16,K04000001,england and wales,1999-02-05,17974.0,NaN,21549.0,NaN,51933471.0,85000.0,Operations Analyst,"['Python', 'Optimization', 'Process Improvement']",False,False,1.00
17,N92000002,brent,1999-04-03,15798.0,NaN,19093.0,NaN,1679006.0,140000.0,Database Administrator,"['Data Recovery', 'Security', 'NoSQL']",True,True,19665.79
18,S92000003,scotland,1999-06-09,16914.0,NaN,19667.0,NaN,5071950.0,76000.0,Database Administrator,NaN,False,False,1.00
19,W92000004,wales,1999-10-08,16457.0,NaN,18486.0,NaN,NaN,84000.0,Database Administrator,"['SQL', 'Database Tuning', 'Backup Management']",True,True,1.00
20,E09000001,city of london,1999-07-12,33020.0,NaN,48922.0,0.0,6581.0,122000.0,Operations Analyst,"['Python', 'Optimization', 'Process Improvement']",False,True,50389.66
21,E09000004,bexley,1999-09-05,18621.0,NaN,21386.0,18.0,217458.0,160000.0,Statistician,"['Probability', 'SAS', 'Regression']",True,False,22027.58
22,K03000001,great britain,1999-11-01,17866.0,NaN,21379.0,NaN,57005421.0,NaN,Operations Analyst,NaN,True,True,1.00
23,E13000001,inner london,1999-02-07,NaN,NaN,NaN,NaN,2750716.0,890121.0,Statistician,"['Statistics', 'Data Cleaning', 'Machine Learn...",False,False,NaN
24,K02000001,united kingdom,1999-02-12,17803.0,NaN,21315.0,NaN,58684427.0,NaN,Statistician,"['Probability', 'SAS', 'Regression']",True,False,1.00
25,E09000005,brent,1999-09-12,18532.0,NaN,20911.0,7.0,260317.0,134000.0,Database Administrator,"['MySQL', 'Oracle', 'Performance Monitoring']",False,True,21538.33